# -*- coding:utf-8 -*-

# 将多个十六进制整合转化为十进制，并返回
def getDecimal(arr):
	if len(arr) == 0:
		return None
	else:
		return int('0x%s' % ''.join(arr).replace('0x',''),16)
# double类型分两段保存，主要是配合jvm
def d2i(value):
	up = value >> 32
	# double up:31(符号占一位),down:32
	# [-/+]000000000000000000000000000000011111111111111111111111111111111
	down = value & 0xFFFFFFFF
	return up,down

if __name__ == '__main__':
	#-------------------------------
	ii = 171 # 1010 1011
	up = ii >> 4
	# 0XF = int('00001111',2)
	down = ii & 0xF
	source = (up << 4) | down
	print up,down,source
	# 11111111111111111111111111111111
	# double up:31(符号占一位),down:32
	# 00000000000000000000000000000000111111111111111111111111111111111
	# 1111111111111111111111111111111011111111111111111111111111111111
	# 11111111111111111111111111111111
	#-------------------------------
